---
title: MEPSystemType
classe: Autodesk.Revit.DB.MEPSystemType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# MEPSystemType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Abbreviation { get; set; }` | `mEPSystemType.Abbreviation` | String |
| `SystemCalculationLevel CalculationLevel { get; set; }` | `mEPSystemType.CalculationLevel` | SystemCalculationLevel |
| `Color FillColor { get; set; }` | `mEPSystemType.FillColor` | Color |
| `ElementId FillPatternId { get; set; }` | `mEPSystemType.FillPatternId` | ElementId |
| `Boolean FillVisible { get; set; }` | `mEPSystemType.FillVisible` | Boolean |
| `Color LineColor { get; set; }` | `mEPSystemType.LineColor` | Color |
| `ElementId LinePatternId { get; set; }` | `mEPSystemType.LinePatternId` | ElementId |
| `Int32 LineWeight { get; set; }` | `mEPSystemType.LineWeight` | Int32 |
| `ElementId MaterialId { get; set; }` | `mEPSystemType.MaterialId` | ElementId |
| `MEPSystemClassification SystemClassification { get; }` | `mEPSystemType.SystemClassification` | MEPSystemClassification |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```